balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F2020.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="30xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="DSPIC30F2020" edc:procid="0x23" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="5.000" edc:maxvoltage="5.500" edc:minvoltage="2.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="3.000" edc:minvoltage="3.000" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="1000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="64"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="30xxxx" edc:name="30xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Data">
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0xffe" edc:id="PgmBootHighMed" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="PgmBootHighSm" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0xffe" edc:id="PgmBootStdMed" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3fe" edc:id="PgmBootStdSm" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="PgmBootNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmBootWrtProtectOff" edc:enableid="PgmBootWrtProtectOn"/>
      </edc:Seg>
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmGenHigh" edc:segsecurity="High" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmGenStd" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmGenNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address error Trap vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="7"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="8"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="9"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="10"/>
    <edc:Interrupt edc:cname="ADCInterrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="11"/>
    <edc:Interrupt edc:cname="NVMInterrupt" edc:desc="NVM Write Complete Interrupt" edc:irq="12"/>
    <edc:Interrupt edc:cname="SI2CInterrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="13"/>
    <edc:Interrupt edc:cname="MI2CInterrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="14"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="16"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="17"/>
    <edc:Interrupt edc:cname="PWMSpEventMatchInterrupt" edc:desc="PWM - PWM Special Event Trigger" edc:irq="18"/>
    <edc:Interrupt edc:cname="PWM1Interrupt" edc:desc="PWM1 - PWM Gen#1 Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="PWM2Interrupt" edc:desc="PWM2 - PWM Gen#2 Interrupt" edc:irq="20"/>
    <edc:Interrupt edc:cname="PWM3Interrupt" edc:desc="PWM3 - PWM Gen#3 Interrupt" edc:irq="21"/>
    <edc:Interrupt edc:cname="PWM4Interrupt" edc:desc="PWM4 - PWM Gen#4 Interrupt" edc:irq="22"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="27"/>
    <edc:Interrupt edc:cname="CMP1Interrupt" edc:desc="CMP1 - Analog Comparator 1" edc:irq="29"/>
    <edc:Interrupt edc:cname="CMP2Interrupt" edc:desc="CMP2 - Analog Comparator 2" edc:irq="30"/>
    <edc:Interrupt edc:cname="CMP3Interrupt" edc:desc="CMP3 - Analog Comparator 3" edc:irq="31"/>
    <edc:Interrupt edc:cname="CMP4Interrupt" edc:desc="CMP4 - Analog Comparator 4" edc:irq="32"/>
    <edc:Interrupt edc:cname="ADCP0Interrupt" edc:desc="ADCP0 - ADC Pair 0 Conversion Done" edc:irq="37"/>
    <edc:Interrupt edc:cname="ADCP1Interrupt" edc:desc="ADCP1 - ADC Pair 0 Conversion Done" edc:irq="38"/>
    <edc:Interrupt edc:cname="ADCP2Interrupt" edc:desc="ADCP2 - ADC Pair 0 Conversion Done" edc:irq="39"/>
    <edc:Interrupt edc:cname="ADCP3Interrupt" edc:desc="ADCP3 - ADC Pair 0 Conversion Done" edc:irq="40"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x2" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x80" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x80" edc:endaddr="0x84" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x84" edc:endaddr="0x100" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x2000" edc:regionid="program"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x800600" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x8005c0" edc:endaddr="0x800600" edc:regionid="userid"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf80014" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="------------nnnn" edc:cname="FBS" edc:default="0xffff" edc:desc="" edc:impl="0xf" edc:name="FBS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BWRP" edc:desc="Boot Segment Write Protect" edc:mask="0x1" edc:name="BWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="BWRP_OFF" edc:codeguardidref="PgmBootWrtProtectOff" edc:desc="Boot Segment may be written" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="BWRP_OFF"/>
                  <edc:LegacyAlias edc:cname="WR_PROT_BOOT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="BWRP_ON" edc:codeguardidref="PgmBootWrtProtectOn" edc:desc="Boot Segment is write protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="BWRP_ON"/>
                  <edc:LegacyAlias edc:cname="WR_PROT_BOOT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BSS" edc:desc="Boot Segment Program Flash Code Protection" edc:mask="0x7" edc:name="BSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_CODE" edc:codeguardidref="PgmBootNone" edc:desc="No Boot Segment" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NO_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_BOOT_CODE" edc:codeguardidref="PgmBootStdSm" edc:desc="Standard Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_SMALL_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="STRD_MEDIUM_BOOT_CODE" edc:codeguardidref="PgmBootStdMed" edc:desc="Standard Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="STRD_MEDIUM_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:desc="No Boot Segment" edc:isidehidden="true" edc:islanghidden="true" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_BOOT_CODE" edc:codeguardidref="PgmBootHighSm" edc:desc="High Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_SMALL_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_BOOT_CODE" edc:codeguardidref="PgmBootHighMed" edc:desc="High Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HIGH_MEDIUM_BOOT_CODE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="2"/>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FGS" edc:default="0xffff" edc:desc="" edc:impl="0x7" edc:name="FGS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="GWRP_OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="General Segment may be written" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GWRP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="GWRP_ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="General Segment is write protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GWRP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GSS" edc:desc="General Segment Code Protection" edc:mask="0x3" edc:name="GSS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="GSS_OFF" edc:codeguardidref="PgmGenNone" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_OFF"/>
                  <edc:LegacyAlias edc:cname="CODE_PROT_OFF"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="GSS_ON" edc:codeguardidref="PgmGenStd" edc:desc="Enabled" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_ON"/>
                  <edc:LegacyAlias edc:cname="GSS_STD"/>
                  <edc:LegacyAlias edc:cname="CODE_PROT_ON"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x2000"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="GSS_HIGH" edc:codeguardidref="PgmGenHigh" edc:desc="High Security Code Protection Enabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GSS_HIGH"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x2000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------------nn" edc:cname="FOSCSEL" edc:default="0xffff" edc:desc="" edc:impl="0x3" edc:name="FOSCSEL" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Mode" edc:mask="0x3" edc:name="FNOSC" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PRIOSC_PLL" edc:desc="Primary Oscillator (HS, EC) w/ PLL" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PRIOSC_PLL"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PRIOSC" edc:desc="Primary Oscillator (HS, EC)" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PRIOSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_PLL" edc:desc="Internal Fast RC (FRC) w/ PLL" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_PLL"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Internal Fast RC (FRC)" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnn--nnn" edc:cname="FOSC" edc:default="0xffff" edc:desc="" edc:impl="0xe7" edc:name="FOSC" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMD" edc:desc="Primary Oscillator Source" edc:mask="0x3" edc:name="POSCMD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PRIOSC_OFF" edc:desc="Primary Oscillator Disabled" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PRIOSC_OFF"/>
                  <edc:LegacyAlias edc:cname="HS_EC_DIS"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Oscillator Mode" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="HS"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Reserved" edc:ishidden="true" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NONE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC Oscillator Mode" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="EC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="OSCI/OSCO Pin Function" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OSC2_CLKO" edc:desc="OSCO pin has clock out function" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="OSC2_CLKO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OSC2_IO" edc:desc="OSCO pin has digital I/O function" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="OSC2_IO"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="FRANGE" edc:desc="Frequency Range Select" edc:mask="0x1" edc:name="FRANGE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="FRC_LO_RANGE" edc:desc="Low Range" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_LO_RANGE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FRC_HI_RANGE" edc:desc="High Range" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FRC_HI_RANGE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSW_FSCM_OFF" edc:desc="Sw Disabled, Mon Disabled" edc:when="(field &amp; 0x2) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_FSCM_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="CSW_ON_FSCM_OFF" edc:desc="Sw Enabled, Mon Disabled" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_ON_FSCM_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="CSW_FSCM_ON" edc:desc="Sw Enabled, Mon Enabled" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CSW_FSCM_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
