balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F2020.PIC
      <edc:DCRDef edc:access="--------nn-nnnnn" edc:cname="FWDT" edc:default="0xffff" edc:desc="" edc:impl="0xdf" edc:name="FWDT" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xdf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscaler" edc:mask="0xf" edc:name="WDTPS" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS32768" edc:desc="1:32,768" edc:when="(field &amp; 0xf) == 0xf">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS32768"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS16384" edc:desc="1:16,384" edc:when="(field &amp; 0xf) == 0xe">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS16384"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS8192" edc:desc="1:8,192" edc:when="(field &amp; 0xf) == 0xd">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS8192"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS4096" edc:desc="1:4,096" edc:when="(field &amp; 0xf) == 0xc">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS4096"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS2048" edc:desc="1:2,048" edc:when="(field &amp; 0xf) == 0xb">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS2048"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS1024" edc:desc="1:1,024" edc:when="(field &amp; 0xf) == 0xa">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS1024"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS512"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS256"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS128"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS64"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS32"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS2"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPOST_PS1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPOST_PS1"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWPSA0" edc:desc="WDT Prescaler" edc:mask="0x1" edc:name="FWPSA0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WDTPRE_PR128" edc:desc="1:128" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPRE_PR128"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WDTPRE_PR32" edc:desc="1:32" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WDTPRE_PR32"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="WWDTEN" edc:desc="Watchdog Timer Window" edc:mask="0x1" edc:name="WWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WINDIS_OFF" edc:desc="Non-Window mode" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WINDIS_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="WINDIS_ON" edc:desc="Window mode" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="WINDIS_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="FWDTEN_ON" edc:desc="Enable" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FWDTEN_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="FWDTEN_OFF" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="FWDTEN_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FPOR" edc:default="0xffff" edc:desc="" edc:impl="0x7" edc:name="FPOR" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FPWRT" edc:desc="POR Timer Value" edc:mask="0x7" edc:name="FPWRT" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="PWRT_128" edc:desc="128ms" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_128"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_64" edc:desc="64ms" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_64"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_32" edc:desc="32ms" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_32"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_16" edc:desc="16ms" edc:when="(field &amp; 0x7) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_16"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_8" edc:desc="8ms" edc:when="(field &amp; 0x7) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_8"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_4" edc:desc="4ms" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_4"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_2" edc:desc="2ms" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_2"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="PWRT_OFF" edc:desc="Off" edc:when="(field &amp; 0x7) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="PWRT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------n-----nn" edc:cname="FICD" edc:default="0xffff" edc:desc="" edc:impl="0x83" edc:name="FICD" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x83">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="Comm Channel Select" edc:mask="0x3" edc:name="ICS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGD" edc:desc="Use PGC/EMUC and PGD/EMUD" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ICS_PGD"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ICS_PGD1" edc:desc="Use EMUC1 and EMUD1" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ICS_PGD1"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ICS_PGD2" edc:desc="Use EMUC2 and EMUD2" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ICS_PGD2"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="NONE"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="BACKBUG" edc:desc="Background Debug" edc:ishidden="true" edc:mask="0x1" edc:name="BACKBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
